{
    "categories" : [
        {
            "name" : "Food Allergies",
            "topics" : [
                { 
                    "name" : "Strawberries",
                    "body" : "Strawberries aren't especially allergic foods, but as a fruit product they can contain unhealthy amounts of pesticides.\nThey're also considerably acidic, so they may cause skin irritants.\nSource:\nhttps://www.healthline.com/health/parenting/can-babies-eat-strawberries#Introducing-Strawberries"
                },
                {
                    "name" : "Honey",
                    "body" : "Honey should not be fed to children under 12 months of age.\nIt contains small amounts of bacteria that can cause infant botulism.\nIf you've fed your child honey and you start to see symptoms of any kind developing, make an appointment with your doctor as soon as possible.\nSource:\nhttps://www.parents.com/baby/feeding/when-can-my-baby-eat-honey/."
                }
            ]
        },
        {
            "name" : "Motor Development",
            "topics" : [
                {
                    "name" : "Speech",
                    "body" : "1-3 Months: Babies coo and cry\n4-6 Months: More sounds but no clear words yet\n6-9 Months: Babies will start to imitate tones, words, and general speech\n12 Months: Words will start to appear, and by 2 years short sentences will start to arise.\n 2-3 Years: Sentences can be 4-5 words, and can use words to identify objects.\nSource:\nhttps://www.pregnancybirthbaby.org.au/speech-development-in-children"
                },
                {
                    "name" : "Walking & Crawling",
                    "body" : "Babies typically begin to crawl between 6-10 months. It's not uncommon for them to skip crawling altogether however.\nIt's a good idea to give babies incentives to move around (like placing toys just out of reach).\nIf your baby hasn't shown any progress in movement by 12 months, or drags one side while crawling, consult a pediatrician.\nSource:\nhttps://www.parents.com/baby/development/crawling/when-do-babies-crawl/"
                },
                {
                    "name" : "Coordination",
                    "body" : "In the range of 3-6 months, babies will begin to grab and inspect items a lot more.\nThis increases as they age, as they subconciously develop their hand-eye coordination.\nYou can help develop these skills by letting them watch you while you perform tasks such as opening doors, clean surfaces, and eating.\nSource:\nhttps://otteroo.com/blog/baby-hand-eye-coordination/"
                }
            ]
        },
        {
            "name" : "Common Illnesses",
            "topics" : [
                {
                    "name" : "RSV",
                    "body" : "RSV (Respiratory Syncytial Virus) is a common, contagious virus that infects the respiratory tract of most children before their second birthday.\nMost babies/young children won't experience much more then cold, but there is a chance that it can lead to a life-treatening problem like pneumonia or bronchiolitis.\nRSV infections can cause cold-like symptoms, lasting 1-2 weeks but more serious symptoms like coughing with deeply colored mucus, dehydration, or problems with breathing can arise.\nCall your doctor if these arise, and if they are very tired, breathing rapidly, or appear blue tinted on their fingers, call 911 or go to the ER immediately.\nSource:\nhttps://www.webmd.com/lung/rsv-in-babies"
                },
                {
                    "name" : "Whooping Cough",
                    "body" : "Whooping Cough (Pertussis) can cause serious illness anyone, but especially in babies 1 year or younger.\nThe early symptoms of it are similar to the common cold, so only later symptoms can indicate an infection.\nSymptoms at a later point include 'fits' of rapid coughing followed by a high-pitched 'whoop' sound, vomiting after coughing 'fits' and exhaustion after coughing 'fits'\nAlmost half of young children affected require hospitalization, so see a doctor as soon as discernible symptoms arise.\nSource:\nhttps://www.cdc.gov/pertussis/about/signs-symptoms.html"
                },
                {
                    "name" : "Influenza",
                    "body" : "The flu (Influenza) just like RSV and Whooping Cough can display symptoms similar to a cold, the flu will onset much quicker then a cold however.\nAny symptoms typical of the flu for adults will be the same for children.\nIt is imperative to visit a doctor when symptoms arise, as the flu can leave a child with a weakened immune system, especially for infants 6 months or younger.\nSource:\nhttps://www.webmd.com/children/your-baby-flu-faq#1"
                }
            ]
        },
        {
            "name" : "Products",
            "topics" : [
                {
                    "name" : "Clothes",
                    "body" : "Keeping your child warm is extremely important. They aren't big enough yet to keep themselves warm (or know how to put on layers for themselves for that matter)\nOnesies and jumpsuits are good for keeping them warm, as are jammies for bedtime."
                },
                {
                    "name" : "Toys",
                    "body" : "The best toys are ones that stimulate all of your babies senses.\nToys that stack together are also good for developing spacial awareness skills and basic mathematical understanding."
                },
                {
                    "name" : "Car Seats",
                    "body" : "Car seats have a limited time span of useability in a infants growth, but they are necessary in that time span.\nIt's always good to do your own research, but a recommendable selection would be the 'Chicco KeyFit 30' for most babies, and the 'Britax B-Safe 35' for a taller baby.\nIn any case, make sure the baby seat you buy has high crash ratings, since that will matter most in the worst situations.\nSource:\nhttps://www.nytimes.com/wirecutter/reviews/best-infant-car-seat/"
                }
            ]
        }
    ],
    "ages" : [
        "0-6 Months",
        "7-12 Months",
        "13-18 Months",
        "19-24 Months",
        "25-30 Months",
        "31-36 Months"
    ],
    "journals" : [
        {
            "id" : 1,
            "title" : "First Journal",
            "entry" : "Trying the journal out, woohoo!"
        },
        {
            "id" : 2,
            "title" : "Tracking Food Reactions",
            "entry" : "5/10 Broke out after PB"
        },
        {
            "id" : 3,
            "title" : "Weird poops",
            "entry" : "5/1 looked like sand\n5/3 solid. constipated?"
        },
        {
            "id" : 4,
            "title" : "When big things happened",
            "entry" : "4/14 first steps!\n6/12 first word 'mama'!"
        },
        {
            "id" : 5,
            "title" : "Foods that worked",
            "entry" : "Avocado\ncheese\ntomatoes (not too much)"
        },
        {
            "id" : 6,
            "title" : "Some",
            "entry" : "5/10 Broke out after PB"
        },
        {
            "id" : 7,
            "title" : "More",
            "entry" : "Trying the journal out, woohoo!"
        },
        {
            "id" : 8,
            "title" : "Faked",
            "entry" : "5/10 Broke out after PB"
        },
        {
            "id" : 9,
            "title" : "User",
            "entry" : "Trying the journal out, woohoo!"
        },
        {
            "id" : 10,
            "title" : "Entries",
            "entry" : "5/10 Broke out after PB"
        },
        {
            "id" : 11,
            "title" : "To Make",
            "entry" : "Trying the journal out, woohoo!"
        },
        {
            "id" : 12,
            "title" : "A Long",
            "entry" : "5/10 Broke out after PB"
        },
        {
            "id" : 13,
            "title" : "List",
            "entry" : "Trying the journal out, woohoo!"
        },
        {
            "id" : 14,
            "title" : "Of Journals",
            "entry" : "5/10 Broke out after PB"
        }
    ],
    "Tips": [
        {
            "info" : "Clicking this button will randomly display a tip!"
        },
        {
            "info" : "The Journal Screen lets you type stuff in!"
        },
        {
            "info" : "This app doesn't require data to run!"
        },
        {
            "info" : "Edited entries remain as such till app close"
        },
        {
            "info" : "'Random' in this case is not a 'smart' random"
        },
        {
            "info" : "We are not medical professionals"
        },
        {
            "info" : "Closing a journal modal saves it's info!"
        },
        {
            "info" : "Not an offical app, bugs may be present"
        },
        {
            "info" : "Not sponsored"
        },
        {
            "info" : "We hope you enjoy this app"
        }
    ]
}